Revit 2027 API
Concrete Class
 A static class that provides access to the property names that appear in the Concrete visual asset schema.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Concrete
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class Concrete
Public NotInheritable Class Concrete
public ref class Concrete abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Concrete = class end
The Concrete type exposes the following members.
Properties
Name | Description
CommonTintColor |  The property labeled "Tint Color" from the "Concrete" schema.
CommonTintToggle |  The property labeled "Tint" from the "Concrete" schema.
ConcreteBmMap |  The property labeled "Image" from the "Concrete" schema.
ConcreteBrightmode |  The property labeled "Weathering" from the "Concrete" schema.
ConcreteBumpAmount |  The property labeled "Amount" from the "Concrete" schema.
ConcreteBumpMap |  The property labeled "Image" from the "Concrete" schema.
ConcreteColor |  The property labeled "Color" from the "Concrete" schema.
ConcreteFinish |  The property labeled "Type" from the "Concrete" schema.
ConcreteSealant |  The property labeled "Sealant" from the "Concrete" schema.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace